%% 目的：利用像素得到数据
%% 输入imshow('tcd.png')读入图像
%% 输入ginput选择像素点
%% 生成像素点如下
pixel =  [   53.4000  276.9865
   50.8423  103.0635
  121.9462  214.0673
  274.3846  214.0673
  129.6192  204.8596
  132.1769  198.2096
  135.7577  189.5135
  142.4077  178.2596
  149.5692  170.5865
  159.8000  168.5404
  164.9154  175.7019
  174.1231  180.8173
  180.2615  186.9558
  186.4000  190.5365
  195.6077  192.5827
  201.7462  196.1635
  209.4192  197.1865
  217.6038  202.3019
  223.7423  205.3712
  232.9500  212.5327
  232.9500  213.0442
  238.5769  214.5788
  244.2038  219.1827
  253.9231  221.2288
  259.0385  223.7865
  264.1538  223.7865
  271.3154  221.2288
  277.9654  213.5558
];
%% 下面进行缩放
%% 利用前两个数据点得到像素纵坐标与实际数据纵坐标之间的关系
%% 利用第三个第四个横坐标得到两者横坐标之间的关系
for i = 1:28
    ai = pixel(:,2)   %像素点纵坐标
    bi = pixel(:,1)   %像素点横坐标
    k_vecolity = 120 / (pixel(1,2)-pixel(2,2))    %纵向的缩放关系
    k_time = 0.8 / (pixel(4,1)-pixel(3,1))        %横向的缩放关系
    ci = 120 - k_vecolity*(ai-pixel(2,2))         %得到实际数据的纵坐标
    di = (k_time) * (bi - pixel(3,1))             %得到实际数据的横坐标
end
m = [di,ci];
t = m(5:28,1:2);
x = t(:,1);
y = t(:,2);
cftool